##### import library :- pandas used for series & data frames. more than numpy

In [ ]:
#list=array-series
#dataframe
#concat,merge,join
#save to csv

In [2]:
import numpy as np
import pandas as pd

In [3]:
#series
mylist=[5,4,6.1,7,8.3,2.7,3]
mylist

[5, 4, 6.1, 7, 8.3, 2.7, 3]

In [4]:
myarray=np.array(mylist)
myarray

array([5. , 4. , 6.1, 7. , 8.3, 2.7, 3. ])

In [5]:
myseries1=pd.Series(data=mylist)
myseries1

0    5.0
1    4.0
2    6.1
3    7.0
4    8.3
5    2.7
6    3.0
dtype: float64

In [6]:
print(myseries1)

0    5.0
1    4.0
2    6.1
3    7.0
4    8.3
5    2.7
6    3.0
dtype: float64

In [7]:
myseries2=pd.Series(data=myarray)
myseries2

0    5.0
1    4.0
2    6.1
3    7.0
4    8.3
5    2.7
6    3.0
dtype: float64

In [8]:
print(myseries2)

0    5.0
1    4.0
2    6.1
3    7.0
4    8.3
5    2.7
6    3.0
dtype: float64

In [9]:
#data type float 64- represent a FINITE SET OF REAL NUMBers with a floating point value

In [10]:
#we can add lables

mylabels=['first','second','third','fourth','fifth','sixth','seventh']

In [11]:
myseries3=pd.Series(data=mylist,index=mylabels)
print(myseries3)

first      5.0
second     4.0
third      6.1
fourth     7.0
fifth      8.3
sixth      2.7
seventh    3.0
dtype: float64

In [12]:
#explicit about entries of pd.series

In [13]:
myseries4=pd.Series(mylist,mylabels)
print(myseries4)

first      5.0
second     4.0
third      6.1
fourth     7.0
fifth      8.3
sixth      2.7
seventh    3.0
dtype: float64

In [14]:
print(myseries4['second'])

4.0

In [15]:
#small maths on series
myseries5=pd.Series([5.5,1.1,8.8,1.6],['first','second','third','fourth'])
print(myseries5)

first     5.5
second    1.1
third     8.8
fourth    1.6
dtype: float64

In [16]:
#nan = not a number
print(myseries5+myseries4)

fifth       NaN
first      10.5
fourth      8.6
second      5.1
seventh     NaN
sixth       NaN
third      14.9
dtype: float64

In [17]:
#we can combine series to create a dataframe using the concat function
#conact merge all the data together
#axis is the format and =1 means arrange it in a sequence format
#sort false means mix- sort do in alpjabetical order


df1=pd.concat([myseries4,myseries5],axis=1,sort=False)
df1

           0    1
first    5.0  5.5
second   4.0  1.1
third    6.1  8.8
fourth   7.0  1.6
fifth    8.3  NaN
sixth    2.7  NaN
seventh  3.0  NaN

In [18]:
#new dataframe 
df2=pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0 -1.054389  2.135953  0.197193  1.460512  1.096631
1 -0.784289  1.631740  0.411472 -0.107109 -1.086970
2  0.322612 -1.874381 -1.890850 -0.585407 -0.644361
3 -0.093253 -0.041465 -0.208821 -0.058155  0.301719
4 -0.547348  0.010325  0.519321 -0.502095 -0.677378

In [19]:
#give lables & rows 
df3=pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row    2.200773    2.163196   0.056647    0.049611   0.374812
second row  -0.573525   -1.124353  -0.579588   -0.004504  -0.687948
third row   -0.322893   -1.096436   0.592599   -0.847777  -0.894252
fourth row  -0.994960    0.547576   0.190423    1.493785   1.025103
fifth row   -2.130984   -1.352616   0.355327   -1.607935  -0.891739

In [20]:
#accessing individual series in a dataframe
print(df3['second col'])

first row     2.163196
second row   -1.124353
third row    -1.096436
fourth row    0.547576
fifth row    -1.352616
Name: second col, dtype: float64

In [21]:
df3[['third col','first col']]

            third col  first col
first row    0.056647   2.200773
second row  -0.579588  -0.573525
third row    0.592599  -0.322893
fourth row   0.190423  -0.994960
fifth row    0.355327  -2.130984

In [22]:
#accessing rows of data frames

df3.loc['fourth row']

first col    -0.994960
second col    0.547576
third col     0.190423
fourth col    1.493785
fifth col     1.025103
Name: fourth row, dtype: float64

In [23]:
#with the help of index 

df3.iloc[1]

first col    -0.573525
second col   -1.124353
third col    -0.579588
fourth col   -0.004504
fifth col    -0.687948
Name: second row, dtype: float64

In [24]:
df3.loc[['fourth row','first row'],['second col','third col']]

            second col  third col
fourth row    0.547576   0.190423
first row     2.163196   0.056647

In [25]:
#logical indexing
#if negative then true, viceversa

df3<=0

            first col  second col  third col  fourth col  fifth col
first row       False       False      False       False      False
second row       True        True       True        True       True
third row        True        True      False        True       True
fourth row       True       False      False       False      False
fifth row        True        True      False        True       True

In [26]:
#where negative coming nan

print(df3[df3>0])

            first col  second col  third col  fourth col  fifth col
first row    2.200773    2.163196   0.056647    0.049611   0.374812
second row        NaN         NaN        NaN         NaN        NaN
third row         NaN         NaN   0.592599         NaN        NaN
fourth row        NaN    0.547576   0.190423    1.493785   1.025103
fifth row         NaN         NaN   0.355327         NaN        NaN

In [27]:
#adding column to dataframe

df3['sixth col']=np.random.randn(5,1)
df3

            first col  second col  third col  fourth col  fifth col  sixth col
first row    2.200773    2.163196   0.056647    0.049611   0.374812   1.132761
second row  -0.573525   -1.124353  -0.579588   -0.004504  -0.687948  -0.561658
third row   -0.322893   -1.096436   0.592599   -0.847777  -0.894252   0.701453
fourth row  -0.994960    0.547576   0.190423    1.493785   1.025103   0.631453
fifth row   -2.130984   -1.352616   0.355327   -1.607935  -0.891739  -0.348131

In [28]:
#remove column
#axis=1 means in a proper format

df3.drop('first col',axis=1)

            second col  third col  fourth col  fifth col  sixth col
first row     2.163196   0.056647    0.049611   0.374812   1.132761
second row   -1.124353  -0.579588   -0.004504  -0.687948  -0.561658
third row    -1.096436   0.592599   -0.847777  -0.894252   0.701453
fourth row    0.547576   0.190423    1.493785   1.025103   0.631453
fifth row    -1.352616   0.355327   -1.607935  -0.891739  -0.348131

In [29]:
#we assign the above table as df4

df4=df3.drop('first col',axis=1)
df4

            second col  third col  fourth col  fifth col  sixth col
first row     2.163196   0.056647    0.049611   0.374812   1.132761
second row   -1.124353  -0.579588   -0.004504  -0.687948  -0.561658
third row    -1.096436   0.592599   -0.847777  -0.894252   0.701453
fourth row    0.547576   0.190423    1.493785   1.025103   0.631453
fifth row    -1.352616   0.355327   -1.607935  -0.891739  -0.348131

In [30]:
#remove index
df4.reset_index()

        index  second col  third col  fourth col  fifth col  sixth col
0   first row    2.163196   0.056647    0.049611   0.374812   1.132761
1  second row   -1.124353  -0.579588   -0.004504  -0.687948  -0.561658
2   third row   -1.096436   0.592599   -0.847777  -0.894252   0.701453
3  fourth row    0.547576   0.190423    1.493785   1.025103   0.631453
4   fifth row   -1.352616   0.355327   -1.607935  -0.891739  -0.348131

In [31]:
#assign new names in index
df4['name']=['luv','kush','rashmi','raksha','sakshi']
df4

            second col  third col  fourth col  fifth col  sixth col    name
first row     2.163196   0.056647    0.049611   0.374812   1.132761     luv
second row   -1.124353  -0.579588   -0.004504  -0.687948  -0.561658    kush
third row    -1.096436   0.592599   -0.847777  -0.894252   0.701453  rashmi
fourth row    0.547576   0.190423    1.493785   1.025103   0.631453  raksha
fifth row    -1.352616   0.355327   -1.607935  -0.891739  -0.348131  sakshi

In [32]:
df4.mean()

C:\Users\raksh\AppData\Local\Temp/ipykernel_1836/1527584861.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df4.mean()

second col   -0.172527
third col     0.123082
fourth col   -0.183364
fifth col    -0.214805
sixth col     0.311176
dtype: float64

In [33]:
df4.median()

C:\Users\raksh\AppData\Local\Temp/ipykernel_1836/3254786010.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df4.median()

second col   -1.096436
third col     0.190423
fourth col   -0.004504
fifth col    -0.687948
sixth col     0.631453
dtype: float64

In [34]:
#combining dataframes
#there are 3 methods to combine dataframe
#concat- display everything together
#join- summation, mathematical values use
#merge- merging both tables into 1

#u can call library again if want as starting new datas

import pandas as pd

In [35]:
#always use first index as "" double as it is first (customer) then ''

df8= pd.DataFrame({"customer":[101,102,103,104],
                  'category':['cat1','cat2','cat3','cat4'],
                  'important':["yes","no","yes","yes"],
                  'sales':[123,345,556,677]})
#index[0,1,2,3]df
df8

   customer category important  sales
0       101     cat1       yes    123
1       102     cat2        no    345
2       103     cat3       yes    556
3       104     cat4       yes    677

In [36]:
df9=pd.DataFrame({"customer":[131,464,575,797],
                 'color':["red","yellow","green","blue"],
                 'distance':[6,8,5,4],
                 'sales':[455,767,878,432]})
df9

   customer   color  distance  sales
0       131     red         6    455
1       464  yellow         8    767
2       575   green         5    878
3       797    blue         4    432

In [38]:
pd.concat([df8,df9],axis=0,sort=False)

   customer category important  sales   color  distance
0       101     cat1       yes    123     NaN       NaN
1       102     cat2        no    345     NaN       NaN
2       103     cat3       yes    556     NaN       NaN
3       104     cat4       yes    677     NaN       NaN
0       131      NaN       NaN    455     red       6.0
1       464      NaN       NaN    767  yellow       8.0
2       575      NaN       NaN    878   green       5.0
3       797      NaN       NaN    432    blue       4.0

In [39]:
pd.concat([df8,df9],axis=0,sort=True)

#by sort true its in alphabetical order

  category   color  customer  distance important  sales
0     cat1     NaN       101       NaN       yes    123
1     cat2     NaN       102       NaN        no    345
2     cat3     NaN       103       NaN       yes    556
3     cat4     NaN       104       NaN       yes    677
0      NaN     red       131       6.0       NaN    455
1      NaN  yellow       464       8.0       NaN    767
2      NaN   green       575       5.0       NaN    878
3      NaN    blue       797       4.0       NaN    432

In [40]:
#merge and join
#merge combines dataframe using a column's value to identify common entries
#join combines dataframes using the index to identify common entries

In [43]:
#outer range is union
#customer is the primary key

pd.merge(df8,df9,how='outer',on='customer')

   customer category important  sales_x   color  distance  sales_y
0       101     cat1       yes    123.0     NaN       NaN      NaN
1       102     cat2        no    345.0     NaN       NaN      NaN
2       103     cat3       yes    556.0     NaN       NaN      NaN
3       104     cat4       yes    677.0     NaN       NaN      NaN
4       131      NaN       NaN      NaN     red       6.0    455.0
5       464      NaN       NaN      NaN  yellow       8.0    767.0
6       575      NaN       NaN      NaN   green       5.0    878.0
7       797      NaN       NaN      NaN    blue       4.0    432.0

In [44]:
#inner merge is intersection

pd.merge(df8,df9,how='inner',on='customer')

#means nothing in common

Empty DataFrame
Columns: [customer, category, important, sales_x, color, distance, sales_y]
Index: []

In [45]:
#left merge is just first on, but all columns
#function left will pick up left table data and vice versa

pd.merge(df8,df9,how='left',on='customer')

   customer category important  sales_x color  distance  sales_y
0       101     cat1       yes      123   NaN       NaN      NaN
1       102     cat2        no      345   NaN       NaN      NaN
2       103     cat3       yes      556   NaN       NaN      NaN
3       104     cat4       yes      677   NaN       NaN      NaN

In [46]:
pd.merge(df8,df9,how='right',on='customer')

   customer category important  sales_x   color  distance  sales_y
0       131      NaN       NaN      NaN     red         6      455
1       464      NaN       NaN      NaN  yellow         8      767
2       575      NaN       NaN      NaN   green         5      878
3       797      NaN       NaN      NaN    blue         4      432

In [51]:
#join behaves just like merge except instead of using values of columns
#MERGE on the basis of 1234, nd merge on the basis of primary key

df10=pd.DataFrame({'Q1':[101,102,103],'Q2':[201,202,203]},index=['I0','I1','I2'])
df11=pd.DataFrame({'Q3':[301,302,303],'Q4':[401,402,403]},index=['I0','I2','I3'])

In [52]:
#outer inner,left,right same as merge
#outer mens union
#inner is intersection
df10.join(df11,how='outer')

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1  102.0  202.0    NaN    NaN
I2  103.0  203.0  302.0  402.0
I3    NaN    NaN  303.0  403.0

In [53]:
#basic functions of panda

In [55]:
df9['color'].unique()

array(['red', 'yellow', 'green', 'blue'], dtype=object)

In [56]:
#here data type is object ids means that every subset of data is object id so here no int value no decimal value hence object

In [57]:
df9['color'].value_counts()

red       1
yellow    1
green     1
blue      1
Name: color, dtype: int64

In [58]:
df9.mean()

C:\Users\raksh\AppData\Local\Temp/ipykernel_1836/2323031499.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df9.mean()

customer    491.75
distance      5.75
sales       633.00
dtype: float64

In [59]:
df10.mean()

Q1    102.0
Q2    202.0
dtype: float64

In [60]:
df9.median()

C:\Users\raksh\AppData\Local\Temp/ipykernel_1836/2302204595.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df9.median()

customer    519.5
distance      5.5
sales       611.0
dtype: float64

In [61]:
df9.mode()

   customer   color  distance  sales
0       131    blue         4    432
1       464   green         5    455
2       575     red         6    767
3       797  yellow         8    878

In [62]:
#save and load dataframes
df9

   customer   color  distance  sales
0       131     red         6    455
1       464  yellow         8    767
2       575   green         5    878
3       797    blue         4    432

In [63]:
df9.to_csv('df9.csv',index=True)

In [65]:
new_df9=pd.read_csv('df9.csv',index_col=0)
new_df9

FileNotFoundError: [Errno 2] No such file or directory: 'df9.csv'

In [71]:
df9.to_excel('df9.xlsx',index=False,sheet_name='first sheet')
newer_df9=pd.read_excel('df9.xlsx',sheet_name='first sheet',index_col=0)

In [72]:
newer_df9

           color  distance  sales
customer
131          red         6    455
464       yellow         8    767
575        green         5    878
797         blue         4    432